{
    "buckets": [
        {
            "Name": "main",
            "Source": "https://github.com/ScoopInstaller/Main.git",
            "Updated": "2024-11-01T18:42:11-04:00",
            "Manifests": 1344
        },
        {
            "Name": "extras",
            "Source": "https://github.com/ScoopInstaller/Extras",
            "Updated": "2024-11-01T16:31:41-04:00",
            "Manifests": 2094
        },
        {
            "Name": "nerd-fonts",
            "Source": "https://github.com/matthewjberger/scoop-nerd-fonts",
            "Updated": "2024-10-28T08:43:19-04:00",
            "Manifests": 342
        }
    ],
    "apps": [
        {
            "Info": "",
            "Version": "24.08",
            "Source": "main",
            "Name": "7zip",
            "Updated": "2024-09-09T11:36:08.5111886-04:00"
        },
        {
            "Info": "",
            "Version": "0.14.0",
            "Source": "extras",
            "Name": "alacritty",
            "Updated": "2024-11-01T19:34:38.3778404-04:00"
        },
        {
            "Info": "",
            "Version": "3.14",
            "Source": "main",
            "Name": "dark",
            "Updated": "2024-07-04T01:17:57.9121451-04:00"
        },
        {
            "Info": "",
            "Version": "10.2.0",
            "Source": "main",
            "Name": "fd",
            "Updated": "2024-09-09T11:36:12.5176222-04:00"
        },
        {
            "Info": "",
            "Version": "0.56.0",
            "Source": "main",
            "Name": "fzf",
            "Updated": "2024-11-01T19:34:40.2062145-04:00"
        },
        {
            "Info": "",
            "Version": "1.23.2",
            "Source": "main",
            "Name": "go",
            "Updated": "2024-10-01T17:03:13.1604702-04:00"
        },
        {
            "Info": "",
            "Version": "2.304",
            "Source": "nerd-fonts",
            "Name": "JetBrains-Mono",
            "Updated": "2024-07-03T12:03:35.3347584-04:00"
        },
        {
            "Info": "",
            "Version": "0.44.1",
            "Source": "extras",
            "Name": "lazygit",
            "Updated": "2024-09-18T16:53:33.5012064-04:00"
        },
        {
            "Info": "",
            "Version": "19.1.3",
            "Source": "main",
            "Name": "llvm",
            "Updated": "2024-11-01T19:35:48.4703135-04:00"
        },
        {
            "Info": "",
            "Version": "1.1.5",
            "Source": "main",
            "Name": "lsd",
            "Updated": "2024-09-05T16:46:00.174889-04:00"
        },
        {
            "Info": "",
            "Version": "5.4.7-2",
            "Source": "main",
            "Name": "lua",
            "Updated": "2024-09-09T11:39:07.0301924-04:00"
        },
        {
            "Info": "",
            "Version": "3.11.1",
            "Source": "main",
            "Name": "luarocks",
            "Updated": "2024-07-02T13:43:36.9378971-04:00"
        },
        {
            "Info": "",
            "Version": "14.2.0-rt_v12-rev0",
            "Source": "main",
            "Name": "mingw",
            "Updated": "2024-09-09T11:41:16.5981167-04:00"
        },
        {
            "Info": "",
            "Version": "0.10.2",
            "Source": "main",
            "Name": "neovim",
            "Updated": "2024-11-01T19:36:09.7309676-04:00"
        },
        {
            "Info": "",
            "Version": "23.1.0",
            "Source": "main",
            "Name": "nodejs",
            "Updated": "2024-11-01T19:36:43.4336921-04:00"
        },
        {
            "Info": "",
            "Version": "3.13.0",
            "Source": "main",
            "Name": "python",
            "Updated": "2024-11-01T19:38:01.1376669-04:00"
        },
        {
            "Info": "",
            "Version": "14.1.1",
            "Source": "main",
            "Name": "ripgrep",
            "Updated": "2024-09-09T11:41:57.6071607-04:00"
        },
        {
            "Info": "",
            "Version": "6.00",
            "Source": "main",
            "Name": "unzip",
            "Updated": "2024-07-03T23:27:10.7278254-04:00"
        },
        {
            "Info": "",
            "Version": "20240203-110809-5046fc22",
            "Source": "extras",
            "Name": "wezterm",
            "Updated": "2024-07-03T20:06:17.971977-04:00"
        },
        {
            "Info": "",
            "Version": "0.13.0",
            "Source": "main",
            "Name": "zig",
            "Updated": "2024-09-02T19:37:17.1832372-04:00"
        }
    ]
}
